# Brew Bundle Brewfile Tips
# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

tap "buo/cask-upgrade" # Allow to upgrade casks

# Shared brewfile between perso and work
<%= File.read("../../shared/SharedBrewfile") %>

# Specific to work machine
brew "libpq"

cask "cmux"
cask "conductor"


cask "claude-code@latest"
cask "telegram"
brew "sentry-cli"
brew "postgresql@17"
brew "pgvector"
brew "googleworkspace-cli"
brew "postgresql@16"
brew "ffmpeg"
brew "whisper-cpp"
brew "libexif"
brew "youtubedr"
cask "antigravity"
