tap "aquasecurity/trivy"
tap "heroku/brew"
tap "homebrew/bundle"
brew "act"
brew "coreutils"
brew "asdf"
brew "autojump"
brew "awscli"
brew "python@3.12"
brew "glib"
brew "checkov"
brew "circleci"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "hadolint"
brew "harfbuzz"
brew "libpq"
brew "mkcert"
brew "openjdk"
brew "openjdk@11"
brew "opentofu"
brew "perl"
brew "pipx"
brew "pnpm"
brew "rust"
brew "terrascan"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "aquasecurity/trivy/trivy"
cask "deskpad"
vscode "charliermarsh.ruff"
vscode "circleci.circleci"
vscode "eamodio.gitlens"
vscode "exiasr.hadolint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.java"
vscode "shopify.ruby-lsp"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "william-voyek.vscode-nginx"
